app/controllers/admin_controller.rb

  def index
    @total_stories = Story.count
---
SELECT count(*) AS count_all FROM `stories`

  def show
    @user = User.find_by_name(params[:id])
    @stories_submitted = @user.stories.find(:all, :limit => 6, :order => 'id DESC')
---
SELECT * FROM `users` WHERE (`users`.`name` = 'splisson') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT `stories`.* FROM `stories` INNER JOIN `votes` ON `stories`.id = `votes`.story_id WHERE ((`votes`.user_id = 1)) ORDER BY id DESC LIMIT 6