app/controllers/stories_controller.rb

  def index
    @stories = Story.find :all,
      :order => 'id DESC',
      :conditions => 'votes_count >= 5'
---
SELECT * FROM `stories` WHERE (votes_count >= 5) ORDER BY id DESC

  def show
    @story = Story.find_by_permalink(params[:permalink])
---
SELECT * FROM `stories` WHERE (`stories`.`permalink` = 'cendrillon-once-upon') LIMIT 1

  def edit
    @story = Story.find(params[:id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)

  def create
    @story = Story.new(params[:story])
    @story.user = @current_user

    respond_to do |format|
      if @story.save
---
INSERT INTO `stories` (`name`, `permalink`, `created_at`, `updated_at`, `link`) VALUES('Once upon a time', 'cendrillon-once-upon', '2009-09-30 17:57:52', '2009-09-30 17:57:52', 'http://cendrillon.net')

  def update
    @story = Story.find(params[:id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)

  def vote
    @story = Story.find(params[:id])
    @story.votes.create
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 8)
INSERT INTO `votes` (`created_at`, `updated_at`, `user_id`, `story_id`) VALUES('2009-09-30 19:32:38', '2009-09-30 19:32:38', NULL, 8)