app/controllers/stories_controller.rb

  def show
    @story = Story.find_by_permalink(params[:permalink])
---
SELECT * FROM `stories` WHERE (`stories`.`permalink` IS NULL) LIMIT 1

  def create
    @story = Story.new(params[:story])
    @story.user = @current_user

    respond_to do |format|
      if @story.save
---
INSERT INTO `stories` (`name`, `permalink`, `created_at`, `updated_at`, `votes_count`, `user_id`, `link`, `description`) VALUES('test story', 'test-story', '2009-10-01 00:16:47', '2009-10-01 00:16:47', 0, 1, 'http://www.test.com/', NULL)

  def update
    @story = Story.find(params[:id])

    respond_to do |format|
      if @story.update_attributes(params[:story])
---
UPDATE `stories` SET `updated_at` = '2009-09-30 22:25:22', `name` = 'updated name' WHERE `id` = 1

  def destroy
    @story = Story.find(params[:id])
    @story.destroy
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)
DELETE FROM `stories` WHERE `id` = 1