app/controllers/story_controller.rb

SELECT * FROM `stories` WHERE (`stories`.`permalink` = 'sitepoint-forum') LIMIT 1
---
  def show
    @story = Story.find_by_permalink(params[:permalink])

INSERT INTO `votes` (`created_at`, `updated_at`, `user_id`, `story_id`) VALUES('2009-09-29 22:13:23', '2009-09-29 22:13:23', NULL, 4)
---
  def vote
    @story = Story.find_by_permalink(params[:permalink])
    @story.votes.create(:user => @current_user)