app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`, `email`) VALUES('splisson', '207687000.15193984308808', '2009-09-30 19:31:39', '2009-09-30 19:31:39', '8935a77c78d62b19d74ca8e35e666539962c38f5', NULL)